Repository: blutorange/baryllium
Catalog: resource/locale/*/LC_MESSAGES/i18n.po
Languages: de

# schedule.loading
source: Loading the schedule... please check whether JavaScript is enabled.
de: Der Stundenplan lädt gerade. Bitte überprüfe auch, dass JavaScript aktiviert ist.

# user.change.pwcd
source: Change saved password for Campus Dual
de: Hinterlegtes Passwort für Campus Dual ändern

# user.change.pwcd.submit
source: Update saved password now
de: Passwort jetzt aktualisieren

# user.change.pwcd.required
source: Please enter your Campus Dual password.
de: Gib bitte dein neues Passwort ein.

# servlet.user.pwcd.wrong
source: Campus Dual password is not correct.
de: Passwort für Campus Dual ist falsch.

# servlet.user.pwcd.error
source: An occurred during communication with Campus Dual. Please try again later.
de: Es gab ein Problem bei der Kommunikation mit Campus Dual. Bitte versuche es später erneut.

# user.remove.pwcd.submit
source: Delete saved password for Campus Dual.
de: Hinterlegtes Passwort für Campus Dual aus Datenbank löschen

# user.remove.pwcd.confirm
source: If you delete the saved password, your exam results cannot be updates anymore. Continue?
de: Löschst du das Passwort, kannst du deine neuen Prüfungsergebnisse nicht mehr einsehen. Fortfahren?

# user.change.pwcd.success
source: Password changed successfully.
de: Passwort erfolgreich geändert.

# settings.fieldset.ui
source: Moose
de: Oberfläche

# user.remove.pwcd.success
source: Password deleted successfully.
de: Passwort wurde gelöscht.

# filetree.heading
source: Resource manager
de: Dokumentmanager

# filetree.root.node
source: All courses
de: Alle Module

# filetree.filename
source: File name
de: Dateiname

# filetree.title
source: Document title
de: Name des Dokuments

# filetree.description
source: Description
de: Beschreibung

# filetree.create.time
source: Creation date
de: Erstellungsdatum

# filetree.mime
source: File type (MIME)
de: Dateityp (MIME)

# filetree.details
source: Summary
de: Übersicht

# filetree.download
source: Download file
de: Datei herunterladen

# filetree.update
source: Upload new version
de: Datei aktualsieren

# filetree.upload
source: Upload file
de: Neue Datei hochladen
