Repository: blutorange/baryllium
Catalog: resource/locale/*/LC_MESSAGES/i18n.po
Languages: de

# error.validation
source: Validation error
de: Validierungsfehler

# error.internal
source: Internal error
de: Interner Fehler

# error.security
source: Security error
de: Sicherheitsfehler

# error.database
source: Database error
de: Datenbankfehler

# error.validation.unknown
source: Did not receive error details during entity persist.
de: Keiner Fehlerdetails während Entiätenpersistierung erhalten.

# error.validation.invalid
source: Cannot persist invalid entity.
de: Kann ungültige Entität nicht persistieren.

# validation.user.pwdhash.blank
source: Passworthash zu lang.
de: Passworthash ist leer.

# thread.add
source: Thread name
de: Name des Themas

# thread.delete.dialog.title
source: Delete post
de: Beitrag löschen

# thread.delete.dialog.body
source: Do you want to delete this post?
de: Möchtest du diesen Beitrag wirklick unwiderruflich löschen?

# thread.submit
source: + Post
de: + Hinzufügen

# error.forum.name.overlong
source: Forum name must not be longer than {limit} characters.
de: Name des Forums darf nicht länger als {limit} Zeichen sein.

# register.fos.notfound.message
source: Unknown field of study
de: Studiengang unbekannt

# register.fos.notfound.detail
source: Your discipline {discipline} and subdiscipline {subdiscipline} was not recognized by this system.
de: Dein Studiengang {discipline} / Studientrichtung {subdiscipline} ist diesem System nicht bekannt.

# register.agb.declined
source: Please accept the Terms of Service
de: Bitte akzeptiere die AGBs.

# register.university.notfound.message
source: Unknown university
de: Unbekannte Berufsakademie

# register.university.notfound.detail
source: Your BA university with the ID {identifier} was not recognized by this system.
de: Deine Berufsakademie mit der Nummer {identifier} wurde nicht vom System erkannt.

# register.pass
source: Password for this portal
de: Passwort für dieses Portal

# register.pass.hint
source: At least 5 characters
de: Mindestens 5 Zeichen

# register.pass.repeat
source: Password repeat
de: Passwortwiederholung

# register.password.missing
source: No password given.
de: Es wurde kein Passwort eingegeben.

# register.pass.repeat.hint
source: Please enter the password again
de: Bitte gib das Passwort nochmal ein.

# register.pass.mustequal
source: Passwords do not match
de: Passwörter müssen übereinstimmen.

# register.agb
source: I have read the <a href='javascript:void(0)' data-toggle="modal" data-target='#dialog-agb'>Terms of Service</a> and accept.
de: Ich habe die <a href='javascript:void(0)' data-toggle="modal" data-target='#dialog-agb'>AGB</a> zur Kenntnis genommen und stimmen diesen zu.

# register.agb.hint
source: Please access our Terms of Service?
de: Bitte stimmen Sie den Allgemeinen Geschäftsbedinungen zu.

# register.agb.exists
source: You should read and agree to the Terms of Service.
de: Sie müssen den AGBs zustimmen.

# register.agb.header
source: Terms of Service
de: Allgemeine Geschäftsbedingungen

# register.savecd.label
source: Save Campus Dual password (encrypted with <a target="_blank" href="https://github.com/defuse/php-encryption">defuse/php-encryption)</a>
de: Passwort für Campus Dual speichern (verschlüsselt mit <a target="_blank" href="https://github.com/defuse/php-encryption">defuse/php-encryption)</a>

# register.submit
source: Submit!
de: Absenden!

# register.success
source: Registration complete
de: Registrierung erfolgreich

# register.success.detail
source: Please sign in with your student ID and password to enter the MOOSE.
de: Bitte melde dich mit deiner Matrikelnummer und deinem Passwort an, um MOOSE zu betreten.

# setup.admin.account
source: Site admin account
de: Account für Seitenadministrator

# setup.unlink.message
source: File {name} could not be deleted.
de: Datei {name} konnte nicht entfernt werden.

# setup.unlink.details
source: Please delete the file manually. Database setup is now complete.
de: Bitte löschen Sie diese Datei noch manuell. Das Setup ist abgeschlossen.

# button.dialog.close
source: Close
de: Schließen

# button.delete.thread
source: Delete thread
de: Thema löschen

# button.exam.refresh
source: Refresh exams
de: Liste aktualisieren

# button.schedule.refresh
source: Refresh schedule
de: Stundenplan aktualisieren

# confirm.exam.refresh
source: Refresh exams? This connects to Campus Dual. Doing this too often may invalidate your password.
de: Prüfungsliste aktualisieren? Dies stellt eine Verbindung mit Campus Dual her. Es kann zu Problemen kommen, wenn zu häufig aktualisiert wird.

# confirm.schedule.refresh
source: Refresh schedule? This connects to Campus Dual. Doing this too often may invalidate your password.
de: Stundenplan aktualisieren? Dies stellt eine Verbindung mit Campus Dual her. Es kann zu Problemen kommen, wenn zu häufig aktualisiert wird.

# form.select.required.option
source: Please select
de: Bitte auswählen

# register.mail.failed.message
source: Mail could not be sent
de: Mail konnte nicht versender werden.

# register.mail.failed.details
source: But do not worry, your are registered.
de: Du wurdest aber trotzdem registriert, also keine Sorge.

# setup.admin.sucess.message
source: Site admin account setup successfully
de: Adminkonto eingerichtet

# setup.admin.sucess.detail
source: Now you may import some data into the database.
de: Nun können noch Daten in die Datenbank importiert werden.

# error.unexpected.title
source: Unexpected error.
de: Unerwarteter Fehler.

# error.unexpected.message
source: We are sorry, but there was an unexpected error. Below you might find some helpful details.
de: Es tut uns leid, aber ein Fehler trat auf, den wir nicht nicht vorhersahen. Unten stehen einige Details zu dem Fehler.

# error.database.title
source: Database error
de: Datenbankfehler.

# error.database.message
source: There was an error during a database transaction. Please try again later.
de: Es tut uns leid, aber es gab ein Problem mit der Datenbank. Bite versuche Sie es später erneut.

# lang.german
source: German
de: Deutsch

# lang.english
source: English
de: Englisch

# login.studentid
source: Student ID (Matrikelnummer)
de: Matrikelnummer (S-Nummer)

# login.language
source: Language
de: Sprache

# login.pw.recovery
source: Forgot your password?
de: Passwort vergessen?

# login.goto.pwrecovery
source: Request new password!
de: Neues Passwort anfordern!

# login.not.registered
source: Not yet registered? BA student?
de: Noch nicht registriert? BA-Student?

# login.goto.register
source: Register!
de: Registrieren!

# login.success
source: Login successful
de: Login war erfolgreich.

# login.success.details
source: Click on the link below if your browser does not redirect you.
de: Klicke unten auf den Link, falls du nicht weitergeleitet wirst.

# login.redirect
source: Take me to the requested page.
de: Weiterleitung auf die gewünschte Seite.

# register.studentid.pattern
source: Student ID must consist of 7 digits.
de: Matrikelnummer muss 7-stellige Zahlenfolge sein.

# register.studentid
source: Student ID (Matrikelnummer)
de: Matrikelnummer (S-Nummer)

# register.studentid.exists
source: This user exists already.
de: Nutzer mit dieser Matrikelnummer ist bereits im System vorhanden.

# register.pass.cdual
source: Campus Dual password
de: Passwort für Campus-Dual

# register.cdual.missing
source: Campus Dual password is required.
de: Passwort für Campus Dual muss eingegeben werden.

# register.cdual.hint
source: Used to confirm your account
de: Verwendet für die Bestätigung des Kontos.

# forum.id.invalid.message
source: Invalid forum ID
de: Ungültige Forum-ID

# forum.id.invalid.detail
source: The requested forum does not exists.
de: Das angeforderte Forum scheint nicht zu existieren.

# forum.no.threads
source: There are no threads in this forum yet.
de: Dieses Forum hat leider noch keine Beiträge.

# forum.new.thread
source: Add a new topic
de: Füge ein neues Thema hinzu

# thread.id.invalid.message
source: Invalid thread ID
de: Ungültige Thread-ID

# thread.id.invalid.detail
source: The requested thread does not exist.
de: Das angeforderte Thema scheint nicht zu existieren.

# post.new.content.label
source: Post content
de: Inhalt des Posts

# post.new.submit
source: + New post
de: + Neuer Post

# accessdenied.message
source: Access denied
de: Zugriff verweigert

# accessdenied.detail
source: Please check whether you are signed in and are allowed to perform this action.
de: Bitte überprüfe, ob du eingeloggt bist und die Berechtigungen für diese Aktion hast.

# illegalrequest.message
source: Invalid request
de: Ungültige Anfrage

# illegalrequest.detail
source: The request could not be processed. If you entered the link manually, please recheck.
de: Die Anfrage konnte nicht bearbeitet werden. Falls du einen Link manuell eingegeben hast, überprüfe diesen bitte.

# accessdenied.backto.dashboard
source: You may also return to the dashboard.
de: Du kannst auch zum Dashboard zurückkehren.

# illegalrequest.backto.dashboard
source: You may also return to the dashboard.
de: Du kannst auch zum Dashboard zurückkehren.

# login.studentid.pattern
source: Student ID must consist of 7 digits.
de: Matrikelnummer muss 7-stellige Zahlenfolge sein.

source: Login failure
de: Anmeldung fehlgeschlagen

# login.userorpass.invalid
source: User not found or password wrong.
de: Nutzer nicht gefunden oder Passwort ist falsch.

# post.last.edited
source: last edit on
de: zuletzt editiert am

# default.datetime.format
source: m/d/Y, h:i A
de: d.m.Y, H:i \U\h\r

# default.datetime.formatjs
source: MM/DD/YYYY, hh:mm A
de: DD.MM.YYYY, HH:mm U\hr

# default.date.format
source: m/d/Y
de: d.m.Y

# default.date.formatjs
source: MM/DD/YYYY
de: DD.MM.YYYY

# setup.sadmin.exists.message
source: Site admin exists
de: Seitenadmin existiert schon

# setup.sadmin.exists.details
source: Site admin account created already. Run the setup again or delete the account in the database.
de: Ein Seitenadministratorkonto wurde bereits erstellt. Führen Sie das Setup erneut aus oder löschen Sie das Konto in der Datenbank.

# navigation.label
source: Page navigation
de: Seitennavigation

# navigation.previous
source: Previous
de: Zurück

# navigation.next
source: Next
de: Weiter

# setup.import.complete
source: Operation successful
de: Operation erfolgreich

# setup.import.complete.details
source: {count} object(s) modified.
de: {count} Objekt(e) wurden geändert.

# profile.name
source: Name
de: Vor- und Nachname

# profile.mail
source: Mail address
de: Mailaddresse

# profile.mail.unknown
source: None
de: Unbekannt

# profile.studentid
source: Student ID
de: Matrikelnummer

# profile.fieldofstudy
source: Discipline and subdiscipline
de: Studiengang und Studienrichtung

# profile.fieldofstudy.discipline.none
source: Unknown
de: Unbekannt

# profile.avatar.badfile
source: Avatar image file could not be processed.
de: Bilddatei konnte nicht verarbeitet werden.

# profile.avatar.noimage
source: Avatar file not recognized as a valid image file.
de: Avatardatei ist keine gültige Bilddatei.

# profile.avatar.upload
source: Upload new avatar image
de: Neues Avatarbild hochladen

# profile.avatar.illegible
source: Avatar image file could not be read. Also, please check the file size.
de: Avatardatei konnte nicht gelesen werden. Bitte überprüfe auch die Dateigröße.

# profile.avatar.nofile
source: No avatar image file was sent.
de: Avatardatei wurde nicht mitgeschickt.

# profile.fieldofstudy.subdiscipline.none
source: Unknown
de: Unbekannt

# profile.tutorialgroup.none
source: Unknown
de: Unbekannt

# profile.tutorialgroup
source: Tutorial group
de: Seminargruppe

# profile.postcount
source: Post count
de: Anzahl Beiträge

# profile.nav
source: Profile
de: Profil

# option.edit.mode.label
source: Editing mode
de: Bearbeitung von Inhalten

# option.paging.list.label
source: Show posts on multiple pages
de: Beiträge auf mehreren Seiten darstellen

# option.dashboard.static.label
source: Show dashboard panels separately
de: Dashboardkacheln separat darstellen

# settings.nav
source: Settings
de: Einstellungen

# news.nav
source: News
de: Neuigkeiten

# request.illegal
source: Illegal request
de: Ungültige Anfrage

# rest.no.json
source: This servlet expects a JSON string.
de: Dieses Servlet erwartet einen JSON-String.

# rest.mode.production
source: This servlet cannot be used in a live environment.
de: Dieses Servlet funktioniert nicht in der Produktivumgebung.

# rest.no.json.object
source: This servlet expects a JSON object.
de: Dieses Servlet erwartet ein JSON-Objekt.

# servlet.object.no.such.field
source: Field with name {fieldName} does not exist for the object.
de: Feld mit Namen {fieldName} existiert nicht an Objekt.

# servlet.object.illegal.field.value
source: Invalid value for the field.
de: Ungültiger Wert für Feld.

# servlet.lesson.notutgroup
source: Missing tutorial group
de: Kein Stundenplan möglich.

# servlet.lesson.update.failure
source: Schedule could not be refreshed.
de: Stundenplan konnte nicht aktualisiert werden.

# servlet.lesson.update.nocredentials
source: No credentials for Campus Dual exist for the user.
de: Es sind keine Zugangsdaten für Campus Dual hinterlegt.

# servlet.lesson.notutgroup.details
source: The current user does not belong to a tutorial group with a schedule.
de: Der derzeitige Nutzer gehört keiner Seminargruppe mit Stundenplan an.

# request.access.denied
source: Access denied, not authorized.
de: Zugriff wurde verweigert, da Berechtigungen fehlen.

# request.cidfid.missing
source: Neither course nor forum given.
de: Kein Modul oder Forum übergeben.

# request.cidfid.both
source: Both a course and a forum given.
de: Sowohl Modul als auch Forum übergeben.

# request.content.missing
source: No content given
de: Inhalt (content) fehlt.

# request.post.delete.first
source: The first post of a thread cannot be deleted. Delete the thread instead.
de: Der erste Beitrag eines Themas kann nicht gelöscht werden. Lösche den Beitrag.

# request.cidfid.notfound
source: No course found for course ID {cid} and forum ID {fid}.
de: Kein Modul gefunden für Modul {cid} und Forum {fid}.

# request.uid.missing
source: No user given.
de: Kein Nutzer übergeben.

# request.pid.missing
source: No post given
de: Kein Post übergeben.

# request.pid.notfound
source: No post found for ID {pid}.
de: Kein Post gefunden für Post {pid}.

# request.tid.missing
source: No thread given.
de: Kein Beitrag übergeben.

# request.tid.notfound
source: No thread found for ID {tid}.
de: Kein Beitrag gefunden für Beitrag {tid}.

# request.user.notfound
source: No user found for ID {uid}.
de: Kein Nutzer gefunden für Id {uid}.

# request.studentid.missing
source: No student ID given.
de: Keine Matrikelnummer übergeben.

# document.put.persistenceerror
source: The file could not be saved.
de: Die Datei konnte nicht gespeichert werden.

# sec-schedule
source: Schedule
de: Stundenplan

# sec-exam
source: Exams
de: Prüfungen

# sec-list-user
source: Users
de: Nutzerliste

# sec-forum
source: Module
de: Modul

# sec-forum-named
source: Module {name}
de: Modul {name}

# sec-thread
source: Thread
de: Thema

# sec-thread-named
source: Thread {name}
de: Thema {name}

# sec-post
source: Post
de: Beitrag

# sec-post-named
source: Post {name}
de: Beitrag {name}

# sec-profile
source: Profile
de: Profil

# sec-site-settings
source: Settings
de: Einstellungen

# sec-import-fos
source: MMM - Moose Module Manager
de: MMM - Moose Modul Manager

# post.nav.edit
source: Edit post
de: Beitrag bearbeiten

# post.nav.permlink
source: Share post (permalink)
de: Beitrag teilen (Permalink)

# post.nav.delete
source: Delete post
de: Beitrag löschen

# thread.no.posts
source: There are no posts in this thread.
de: Es gibt keine Beiträge in diesem Thema.

# thread.title.change
source: New thread name
de: Neuer Name des Themas

# thread.title.edithint
source: Click to edit thread name
de: Zum Bearbeiten des Titels klicken

# thread.title.change.placeholder
source: Thread name
de: Name des Themas

# thread.new.post
source: Add a new post
de: Füge einen neuen Post hinzu

# task.mail.send
source: Mail settings
de: Mailversand

# setup.system.logfile
source: Logfile location. Default path is used when not set.
de: Pfad der Logdatei. Wenn nicht angegeben, wird obiger Standardpfad genutzt.

# setup.system.logfile.default
source: Default logfile location
de: Standardpfad der Logdatei

# form.password.hideshow
source: Show/hide password
de: Passwort anzeigen / verstecken

# option.post.count.label
source: Posts per page
de: Anzahl an angezeigten Beiträgen

# dialog.button.close
source: Close
de: Schließen

# post.delete.dialog.title
source: Delete post
de: Beitrag löschen

# post.delete.dialog.body
source: Do you want to delete this post?
de: Willst du diesen Beitrag wirklich löschen?

# post.delete.dialog.confirm
source: Delete post
de: Löschen

# post.delete.dialog.cancel
source: Keep post
de: Nicht löschen

# setup.system.mailtype
source: Mailing method
de: Art des Mailversand

# setup.system.mailtype.php
source: PHP internal via send()
de: PHP-intern mittels send()

# setup.system.mailtype.smtp
source: External SMTP server
de: Externer SMTP-Server

# setup.system.sysmail
source: FROM mail address, used for system mails
de: FROM-Mailadresse, die als Absender für Systemmails erscheint

# setup.system.port
source: Port (default 3306)
de: Port (Standard 3306)

# setup.system.driver
source: Datenbase type
de: Datenbanktyp

# setup.system.dbname
source: Database name (all existing data will be lost)
de: Name der Datenbank (alle Tabellen werden beim Setup gelöscht)

# setup.system.dbnameDev
source: Database name (development)
de: Name der Datenbank (development)

# setup.system.dbnameTest
source: Database name(testing)
de: Name der Datenbank (testing)

# setup.system.user
source: Database user (needs all right for the database except GRANT)
de: Datenbanknutzer (muss alle Rechte für Datenbank haben)

# setup.system.pass
source: User password
de: Passwort für Nutzer

# setup.system.smtpuser
source: User name
de: Nutzername

# setup.system.smtppass
source: Password
de: Passwort

# setup.system.smtpsec
source: Encryption method
de: Art der Verschlüsselung

# setup.system.smtppers
source: Persistent connection
de: Verbindung aufrecht erhalten (persistent connection)

# setup.system.smtptime
source: Connection timeout
de: Zeitbeschränkung für Verbindung (connection timeout)

# servlet.seed.failure
source: Seed servlet seeded a seedling successfully.
de: Seed-Servlet konnte nicht erfolgreich pflanzen.

# servlet.illegal.action
source: Unknown action {action}.
de: Unbekannte Aktion {action}.

# servlet.object.field.empty
source: The field {fieldName} must not be empty.
de: Das Feld {fieldName} darf nicht leer sein.

# servlet.object.field.null
source: The field {fieldName} must exists and must not be empty.
de: Das Feld {fieldName} muss vorhanden und nicht leer sein.

# servlet.object.missing
source: No object given.
de: Objekt nicht übergeben.

# servlet.object.class.missing
source: Object class missing.
de: Objektklasse fehlt.

# servlet.object.count
source: Expected {countExpected} objects, but got {countActual}.
de: Genau {countExpected} Objekte erwartet, aber {countActual} erhalten.

# dashboard.dininghallmenu.none
source: No meals for today.
de: Heute keine Mahlzeiten in der Mensa.

# dashboard.label.dininghallmenu
source: Meals
de: Speiseplan

# dashboard.label.schedule
source: Schedule
de: Stundenplan

# register.campusdual.error
source: An occurred while fetching data from Campus Dual. Please try again later.
de: Es gab einen Fehler bei der Prüfung gegen Campus Dual. Bite versuche es später erneut.

# userlist.head.membersince
source: Registered
de: Registrierungsdatum

# userlist.head.firstname
source: First name
de: Vorname

# userlist.head.lastname
source: Last name
de: Nachname

# userlist.head.tutgroup
source: Tutorial group
de: Seminargruppe

# userlist.head.studentid
source: Student ID
de: Matrikelnummer

# userlist-caption
source: List of all users of your field of study
de: Liste aller Nutzer deiner Studienrichtung

# userlist.head.sid
source: Student ID
de: Matrikelnummer

# pwreset.pass
source: New password
de: Neues Passwort

# pwrecover.submit
source: Request new password
de: Passwortmail anfordern

# pwrecover.mail.subject
source: Moose: Password change requested
de: Moose: Passwort vergessen

# pwrecover.mail.content
source: Change your password: {link} This link is valid for 24 hours.
de: Vergib dir ein neues Passwort: {link} Dieser Link ist 24 Stunden gültig.

# pwrecover.mail.success
source: Mail prepared
de: Mail vorbereitet

# pwrecover.mail.success.details
source: You will receive a mail in a few minutes with a link to change your password. Otherwise, please check your private or BA mail address.
de: Es wird in den nächsten Minuten eine Mail mit einem Link zum Ändern des Passwortes verschickt. Prüfe bitte deine hinterlegte oder BA-Adresse.

# pwrecover.no.user
source: The user was not found.
de: Nutzer nicht gefunden.

# pwrecover.studentid.notexists
source: The user does not exist.
de: Diesen Nutzer gibt es nicht.

# pwreset.token.invalid
source: Password link is not valid.
de: Passwortlink ist nicht gültig.

# pwreset.token.expired
source: Bad password link. Please check whether you copied or clicked the entire link.
de: Passwortlink ist nicht gültig. Der Link ist nur 24 Stunden gültig.

# pwreset.no.pass
source: No password given or does not agree with the password repeat.
de: Kein Passwort eingegeben oder stimmt nicht mit der Passwortwiederholung überein.

# pwreset.no.token
source: Bad password link. Please check whether you copied or clicked the entire link.
de: Falscher Passwortlink. Bitte prüfe, ob du den gesamten Link kopiert hast.

# pwreset.success
source: Password changed successfully
de: Passwort geändert.

# pwreset.success.details
source: You can now sign in with your new password.
de: Du kannst dich jetzt mit deinem neuen Passwort anmelden.

# user.mail.change
source: Change alternative mail adresse
de: Alternative Mailadresse ändern

# inline.edit.tooltip
source: Edit
de: Bearbeiten

# user.site.admin
source: Site administrator
de: Seitenadministrator

# page.login.required
source: Authorization required
de: Anmeldung erforderlich

# page.login.required.details
source: The requested page required you to be signed in.
de: Die angeforderte Seite erfordert die Anmeldung als Nutzer am System.

# page.login.required.sadmin
source: Authorization required
de: Anmeldung erforderlich

# page.login.required.sadmin.details
source: The requested page requires administrative permissions.
de: Die angeforderte Seite erfordert die Anmeldung als Administrator am System.

# footer.ourvision
source: Our vision
de: Unsere Vision

# footer.ourvision.details
source: We want to create one student portal for everything, to take some weight off of your shoulders.
de: Wir wollen den hartarbeitenden dualen Studenten entlasten, indem wir eine Plattform für alle Informationen bieten.

# footer.contact.header
source: Contact
de: Kontakt

# footer.contact
source: Any questions or suggestions?. Let us know!
de: Du hast Fragen, Anregungen, Kritik oder Wünsche? Lass es uns wissen!

# footer.contactus
source: Contact us
de: Schreib uns

# footer.further.information
source: Further information
de: Weiterführende Informationen

# footer.disclaimer
source: Disclaimer
de: Impressum

# footer.privacy
source: Privacy
de: Datenschutz

# footer.terms
source: TOS
de: AGB

# legalese.terms
source: Terms of service
de: Allgemeine Geschäftsbedingungen

# datatable.search.text
source: Search...
de: Suchen...

# datatable.select.none
source: All
de: Keine Filterung

# schedule.heading
source: Your schedule
de: Dein Stundenplan
